apps/backend/tests/load/artillery.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 180
      arrivalRate: 200
      name: "Sustained load (200 concurrent users)"
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: "./processor.js"
  plugins:
    expect: {}
    metrics-by-endpoint:
      stripQueryString: true
      ignoreUnknownEndpoints: true
      metricsPrefix: "api"
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 1000        # 95th percentile response time under 1s
    p99: 2000        # 99th percentile response time under 2s

scenarios:
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: status

  - name: "User Authentication Flow"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ $randomEmail }}"
            password: "TestPassword123!"
          capture:
            - json: "$.accessToken"
              as: "token"
            - json: "$.user.id"
              as: "userId"
          expect:
            - statusCode: 200

      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Dashboard Load"
    weight: 25
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "admin@test.com"
            password: "Admin123!"
          capture:
            - json: "$.accessToken"
              as: "token"

      - get:
          url: "/api/v1/dashboard/admin"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
            - contentType: json

  - name: "Calendar Operations"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "teacher@test.com"
            password: "Teacher123!"
          capture:
            - json: "$.accessToken"
              as: "token"
            - json: "$.user.schoolId"
              as: "schoolId"

      - get:
          url: "/api/v1/lessons?startDate=2025-01-01&endDate=2025-03-31"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/v1/lessons/calendar"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Student Data Access"
    weight: 15
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "parent@test.com"
            password: "Parent123!"
          capture:
            - json: "$.accessToken"
              as: "token"

      - get:
          url: "/api/v1/students"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      - think: 2

      - get:
          url: "/api/v1/invoices"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Attendance Marking"
    weight: 10
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "teacher@test.com"
            password: "Teacher123!"
          capture:
            - json: "$.accessToken"
              as: "token"

      - get:
          url: "/api/v1/lessons/today"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$.lessons[0].id"
              as: "lessonId"
          expect:
            - statusCode: 200

      - patch:
          url: "/api/v1/attendance/{{ lessonId }}/mark"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            attendanceRecords:
              - studentId: "{{ $randomId }}"
                status: "PRESENT"
          expect:
            - statusCode: [200, 400]  # May fail if lesson doesn't exist

  - name: "Hybrid Booking Flow"
    weight: 5
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "parent@test.com"
            password: "Parent123!"
          capture:
            - json: "$.accessToken"
              as: "token"

      - get:
          url: "/api/v1/hybrid-lessons/available-slots"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      - think: 3

      - post:
          url: "/api/v1/hybrid-lessons/book"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            slotId: "{{ $randomId }}"
            studentId: "{{ $randomId }}"
          expect:
            - statusCode: [200, 400, 409]  # May fail due to conflicts